fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <posting>Deny</posting>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресВоВременномХранилище") Тогда
		Адрес = Параметры.АдресВоВременномХранилище;
		
		ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Адрес);
		
		Для Каждого Отпуск Из ТаблицаОтпусков Цикл
			НоваяСтрока = ВКМ_ДанныеГанта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Отпуск);
		КонецЦикла;	
	КонецЕсли;
		
	ВКМ_ЗаполнитьДиаграммуГантаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ЗаполнитьДиаграммуГантаНаСервере()
	
	Диаграмма = ВКМ_ДанныеГанта1;
	Диаграмма.Очистить();
	Диаграмма.Обновление = Ложь;
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	Диаграмма.ВертикальнаяПрокрутка = Истина;
	
	Если ВКМ_ДанныеГанта.Количество() = 0 Тогда
		ВКМ_УстановитьИнтервалПоГоду(Диаграмма);
		Диаграмма.Обновление = Истина;
		Возврат;
	КонецЕсли;
	
	Серия = Диаграмма.УстановитьСерию(НСтр("ru = 'Отпуск'"));
	ЗначенияПоТочкам = Новый Соответствие;
	МинДата = Неопределено;
	МаксДата = Неопределено;
	
	Для Каждого СтрокаТаблицы Из ВКМ_ДанныеГанта Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТочки = СтрокаТаблицы.Подпись;
		Если Не ЗначениеЗаполнено(ИмяТочки) Тогда
			ИмяТочки = СтрокаТаблицы.Сотрудник;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИмяТочки) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеСерии = ЗначенияПоТочкам.Получить(ИмяТочки);
		Если ЗначениеСерии = Неопределено Тогда
			Точка = Диаграмма.УстановитьТочку(ИмяТочки);
			ЗначениеСерии = Диаграмма.ПолучитьЗначение(Точка, Серия);
			ЗначенияПоТочкам.Вставить(ИмяТочки, ЗначениеСерии);
		КонецЕсли;
		
		Интервал = ЗначениеСерии.Добавить();
		Интервал.Начало = НачалоДня(СтрокаТаблицы.ДатаНачала);
		Интервал.Конец = КонецДня(СтрокаТаблицы.ДатаОкончания);
		Интервал.Текст = Формат(СтрокаТаблицы.ДатаНачала, "ДЛФ=D")
			+ " - "
			+ Формат(СтрокаТаблицы.ДатаОкончания, "ДЛФ=D");
		
		Если МинДата = Неопределено Или СтрокаТаблицы.ДатаНачала < МинДата Тогда
			МинДата = СтрокаТаблицы.ДатаНачала;
		КонецЕсли;
		Если МаксДата = Неопределено Или СтрокаТаблицы.ДатаОкончания > МаксДата Тогда
			МаксДата = СтрокаТаблицы.ДатаОкончания;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВКМ_Год) Тогда
		ВКМ_УстановитьИнтервалПоГоду(Диаграмма);
	ИначеЕсли МинДата <> Неопределено И МаксДата <> Неопределено Тогда
		Диаграмма.УстановитьПолныйИнтервал(НачалоДня(МинДата), КонецДня(МаксДата));
	КонецЕсли;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_УстановитьИнтервалПоГоду(Диаграмма)
	
	Если Не ЗначениеЗаполнено(ВКМ_Год) Тогда
		Возврат;
	КонецЕсли;
	
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода(ВКМ_Год), КонецГода(ВКМ_Год));
	
КонецПроцедуры
